Repository: bbc/blogs-frontend
Catalog: translations/blogs/*.po
Languages: cy

# language_code
source: en
cy: cy

# asset_error_without_java
source: This video content is not available, due to a temporary problem.
cy: Nid yw’r fideo yma ar gael oherwydd fod yna broblem dros dro

# author_no_posts
source: There are no posts by this author
cy: Does yna ddim negeseuon gan yr awdur yma

# blog
source: 0 blogs
cy: 0 blogiau

# blog_article_count_archive
source: 0 articles
cy: 0 erthygl

# blog_no_posts
source: There are no posts in this blog
cy: Does yna ddim negeseuon yn y blog yma

# blog_post_count_author
source: Blog post in total 0
cy: Nifer y negeseuon 0

# blog_post_count_tag
source: 0 posts about %tag% on this blog
cy: 0 neges am %tag% yn y blog yma

# error_comments
source: Comments are temporarily unavailable due to a technical fault. Please try later.
cy: Dyw’r sylwadau ddim ar gael ar hyn o bryd oherwydd problem dechnegol. Triwch eto nes ymlaen

# error_no_media
source: Your browser doesn't support HTML5 media.
cy: Dydi eich porwr ddim yn cefnogi cynnwys HTML5

source: Feed
cy: porthwr

# find_us_on_facebook
source: Find us on %1
cy: Dewch o hyd i ni ar %1

# follow_us_on_twitter
source: Follow %1 on Twitter
cy: Dilynwch %1 ar Twitter

# header_archive_month
source: Blog posts by year and month
cy: Negeseuon blog yn ôl blwyddyn a mis

# header_author_all
source: Authors
cy: Awduron

# header_author_latest_post
source: Latest post
cy: Neges ddiweddaraf

# header_author_name
source: Name
cy: Enw

# header_az
source: Blogs A-Z
cy: A-Z Blogiau

# header_more_posts
source: More Posts
cy: Mwy o negeseuon

# header_next
source: Next
cy: Nesaf

# header_posts
source: Posts
cy: Negeseuon

# header_previous
source: Previous
cy: Blaenorol

# header_share_page
source: Share this page
cy: Rhannu'r dudalen yma

# header_tag_ind
source: Tagged with
cy: Tagiwyd gyda

# header_tag_list
source: Tags
cy: Tagiau

# image_notloading
source: This image content is not available, due to a temporary problem
cy: Nid yw’r llun yma ar gael oherwydd fod yna broblem dros dro

# internal_error
source: Page not found
cy: Wedi methu dod o hyd i’r dudalen

# internal_error_note
source: Please check the address and try again
cy: Gwiriwch y cyfeiriad a thrio eto

# internal_error_title
source: lease check the address and try again
cy: Gwiriwch y cyfeiriad a thrio eto

# javascript_required
source: You must enable javascript to play content
cy: Rhaid galluogi javascript i chwarae'r cynnwys

# language_barlesque
source: en-GB
cy: cy-GB

# language_locale
source: en_GB
cy: cy_GB

# link_comments
source: Comments
cy: Sylwadau

# link_home
source: Home
cy: Hafan

# link_next
source: Next
cy: Nesaf

# link_previous
source: Previous
cy: Blaenorol

# link_read_more
source: Read more
cy: Darllen mwy

# link_see_all_authors
source: See all authors
cy: Gweld pob awdur

# link_see_all_posts
source: See all posts
cy: Gweld pob neges

# link_see_all_tags
source: See all tags
cy: Gweld pob tag

# link_top_20
source: Top 20
cy: 20 uchaf

# module_about_header
source: About this Blog
cy: Ynglŷn â’r Blog

# module_about_link_all_blogs
source: Explore all BBC blogs
cy: Edrych trwy holl flogiau’r BBC

# module_about_link_home
source: Blog home
cy: Hafan y Blog

# module_featured_post_header
source: Featured Post
cy: Dan sylw

# module_mostpopular_header
source: Recently Commented
cy: Sylwadau diweddaraf

# module_mostpopular_tab_commented
source: Commented
cy: Sylwadau

# module_updates_content
source: Stay updated with the latest posts from the blog
cy: Darllenwch y diweddaraf yn y blog yma

# module_updates_header
source: Blog Updates
cy: Diweddariadau i’r Blog

# module_updates_header_feed
source: Subscribe to the blog using
cy: Tanysgrifiwch trwy ddefnyddio

# module_updates_link_atom
source: ATOM feed
cy: Llif ATOM

# module_updates_link_feeds
source: What are feeds?
cy: Beth yw llif?

# module_updates_link_rss
source: RSS feed
cy: Llif RSS

# month_no_posts
source: There are no posts in this month
cy: Does yna ddim negeseuon yn y mis yma

# no_posts
source: There are no posts
cy: Does yna ddim negeseuon

source: Page not found
cy: Wedi methu dod o hyd i’r dudalen

# page_not_found_note
source: Please check the address and try again
cy: Gwiriwch y cyfeiriad a thrio eto

# page_not_found_title
source: Sorry, that page was not found
cy: Mae'n ddrwg gennym, rydyn ni wedi methu dod o hyd i’r dudalen

# page_title_archive_month
source: All posts for
cy: Pob cofnod ar gyfer

# no_results
source: There are no results
cy: Dim canlyniadau

# page_title_author_all
source: All Authors
cy: Pob awdur

# page_title_author_az
source: Authors beginning with the letter %1
cy: Awduron yn dechrau â’r lythyren %1

# page_title_author_ind
source: Author
cy: Awdur

# page_title_blogs
source: Blogs
cy: Blogiau

# page_title_tag_cloud
source: Tags Top 20
cy: Tagiau

# page_title_tag_list
source: All tags
cy: Pob tag

# post
source: 0 posts
cy: 0 neges

source: See all posts about
cy: Gweld pob neges am

source: Tagged with
cy: Tagiwyd gyda
